/**
 * @license
 * Copyright Google LLC All Rights Reserved.
 *
 * Use of this source code is governed by an MIT-style license that can be
 * found in the LICENSE file at https://angular.dev/license
 */

// THIS CODE IS GENERATED - DO NOT MODIFY.
  (function(global) {
    global.ng ??= {};
    global.ng.common ??= {};
    global.ng.common.locales ??= {};
    const u = undefined;
    function plural(val) {
const n = val;

if (n === 1)
    return 1;
return 5;
}
    global.ng.common.locales['brx'] = ["brx",[["फुं","बे"],["फुं","बेलासे"]],[["फुं","बेलासे"]],[["र","स","मं","बु","बि","सु","स"],["रबि","सम","मंगल","बुध","बिस्थि","सुखुर","सनि"],["रबिबार","समबार","मंगलबार","बुधबार","बिस्थिबार","सुखुरबार","सनिबार"],["रबि","सम","मंगल","बुध","बिस्थि","सुखुर","सनि"]],[["र","स","मं","बु","बि","सु","स"],["रबि","सम","मंगल","बुध","बिस्थि","सुखुर","सनि"],["रबिबार","समबार","मंगलबार","बुधबार","बिस्थिबार","सुुखुरबार","सनिबार"],["रबि","सम","मंगल","बुध","बिस्थि","सुखुर","सनि"]],[["ज","फ","म","ए","म","ज","ज","आ","स","अ","न","ड"],["जान","फेब","मार्च","एप्रि","मे","जुन","जुल","आग","सेप","अक्ट’","नवे","डिसे"],["जानुवारी","फेब्रूवारी","मार्च","एप्रिल","मे","जुन","जुलाई","आगष्ट","सेप्थेम्बर","अक्ट’बर","नवेम्बर","डिसेम्बर"]],u,[["बि.सि.","ए.दि"],u,["ख्राइष्तनि सिगां","आन्न’ दामिनि"]],0,[0,0],["dd-MM-y","d MMM, y","d MMMM, y","d MMMM y, EEEE"],["a नि h:mm","a h:mm:ss","a h:mm:ss z","a h:mm:ss zzzz"],["{1}, {0}",u,u,u],[".",",",";","%","+","-","E","x","‰","∞","NaN",":"],["#,##,##0.###","#,##,##0%","¤ #,##,##0.00","#E0"],"INR","₹","भारतनि रुपी",{"AED":["ए.इ.दि"],"ALL":["अल"],"AMD":["ए.एम.दि","֏"],"ANG":["ए.एन.जि"],"AOA":["ए.अ.ए","के.जेत"],"ARS":["ए.आर.एस","$"],"AWG":["ए.दब्ल्यु.जि"],"AZN":["ए.जेत.एन","₼"],"BAM":["बि.ए.एम","के.एम"],"BBD":["बि.बि.दि","$"],"BGN":["बि.जि.एन"],"BHD":["बि.ऐत्स.दि"],"BIF":["बि.आइ.एफ"],"BMD":["बि.एम.डि","$"],"BOB":["बि.अ.बि","बि.एस"],"BSD":["बि.एस.दि","$"],"BWP":["बि.दब्ल्यु.पि","पि"],"BYN":["बि.वाई.एन"],"BZD":["बि.जेद.डि","$"],"CAD":["सि.ए $","$"],"CDF":["सि.दि.एफ"],"CHF":["सि.ऐत्स.एफ"],"CLP":["सि.एल.पि","$"],"CNH":["सि.एन.ऐत्स"],"CNY":["सिएन¥","¥"],"COP":["सि.अ.पि","$"],"CRC":["सि.आर.सि","₡"],"CUC":["सि.इउ.सि","$"],"CUP":["सि.इउ.पि","$"],"CVE":["सि.भि.इ"],"CZK":["सि.जेद.के","Kč"],"DJF":["दि.जे.एफ"],"DKK":["दि.के.के","के.आर"],"DOP":["डि.अ.पि","$"],"DZD":["दि.जेत.दि"],"EGP":["ई.जि.पि","E£"],"ERN":["इ.आर.एन"],"ETB":["इ.ति.बि"],"FKP":["एफ.के.पि","£"],"GEL":["जि.इ.एल","₾"],"GHS":["जि.ऐत्स.एस","जि.ऐत्स₵"],"GIP":["जि.आइ.पि","£"],"GMD":["जि.एम.दि"],"GNF":["जि.एन.एफ","एफ.जि"],"GTQ":["जि.ति.किउ","Q"],"GYD":["जि.वाई.दि","$"],"HKD":["ऐत्स.के$","$"],"HNL":["ऐत्स.एन.एल","L"],"HRK":["ऐत्स.आर.के","के.एन"],"HTG":["ऐत्स.ति.जि"],"HUF":["ऐत्स.इउ.एफ","एफ.ति"],"IQD":["आइ.किउ.दि"],"ISK":["आई.एस.के","के.आर"],"JMD":["जे.एम.दि","$"],"JOD":["जे.अ.दि"],"JPY":["JP¥","¥"],"KES":["के.इ.एस"],"KGS":["के.जि.एस","⃀"],"KMF":["के.एम.एफ","सि.एफ"],"KPW":["के.पि.दब्ल्यु","₩"],"KWD":["के.दब्ल्यु.दि"],"KYD":["के.वाई.दि","$"],"KZT":["के.जेत.ति","₸"],"LBP":["एल.बि.पि","एल£"],"LRD":["एल.आर.दि","$"],"LSL":["एल.एस.एल"],"LYD":["एल.वाई.दि"],"MAD":["एम.ए.दि"],"MDL":["एम.डि.एल"],"MGA":["एम.जि.ए","ए.आर"],"MKD":["एम.के.दि"],"MNT":["एम.एन.ति","₮"],"MOP":["एम.अ.पि"],"MRU":["एम.आर.इउ"],"MUR":["एम.इउ.आर","आर.एस"],"MWK":["एम.दब्ल्यु.के"],"MXN":["एम.एक्स $","$"],"MZN":["एम.जेत.एन"],"NAD":["एन.ए.दि","$"],"NGN":["एन.जि.एन","₦"],"NIO":["एन.आई.अ","सि $"],"NOK":["एन.अ.के","के.आर"],"OMR":["अ.एम.आर"],"PAB":["पि.ए.बि"],"PEN":["पि.इ.एन"],"PLN":["पि.एल.एन","zł"],"PYG":["पि.आई.जि","₲"],"QAR":["किउ.ए.आर"],"RON":["आर.अ.एन","लेई"],"RSD":["आर.एस.दि"],"RUB":["रूब","₽"],"RWF":[u,"आर.एफ"],"SAR":["एस.ए.आर"],"SCR":["एस.सि.आर"],"SDG":["एस.दि.जि"],"SEK":["एस.इ.के","के.आर"],"SHP":["एस.ऐत्स.पि","£"],"SLE":["एस.एल.इ"],"SLL":["एस.एल.एल"],"SOS":["एस.अ.एस"],"SRD":["एस.आर.डि","$"],"SSP":["एस.एस.पि","£"],"STN":["एस.ति.एन","दि.बि"],"SYP":["एस.वाई.पि","£"],"SZL":["एस.जेत.एल"],"TJS":["ति.जे.एस"],"TMT":["ति.एम.ति"],"TND":["ति.एन.दि"],"TRY":["ति.आर.वाई","₺"],"TTD":["ति.ति.डि","$"],"TWD":["एन.ति$","$"],"TZS":["ति.जेत.एस"],"UAH":["इउ.ए.ऐत्स","₴"],"UGX":["इउ.जि.एक्स"],"UYU":["इउ.वाई.इउ","$"],"UZS":["इउ.जेत.एस"],"VES":["भि.इ.एस"],"XCD":["इ.सि $","$"],"YER":["वाई.इ.आर"],"ZAR":["जेत.ए.आर","आर"],"ZMW":[u,"जेत.के"]},"ltr", plural, []];
  })(globalThis);
    