/**
 * @license
 * Copyright Google LLC All Rights Reserved.
 *
 * Use of this source code is governed by an MIT-style license that can be
 * found in the LICENSE file at https://angular.dev/license
 */

// THIS CODE IS GENERATED - DO NOT MODIFY.
  (function(global) {
    global.ng ??= {};
    global.ng.common ??= {};
    global.ng.common.locales ??= {};
    const u = undefined;
    function plural(val) {
const n = val;

return 5;
}
    global.ng.common.locales['ks-deva'] = ["ks-Deva",[["AM","PM"],u,["ये एम","पी एम"]],[["AM","PM"],u,["दुपहर ब्रोंठ","दुपहरपतॖ"]],[["अ","च","ब","ब","ब","ज","ब"],["आथवार","चंदिरवार","बुवार","बोदवार","ब्रेसवार","जुमा","बटवार"],["आथवार","च़ंदिरवार","बोमवार","बोदवार","ब्रेसवार","जुमा","बटवार"],["आथवार","चंदिरवार","बुवार","बोदवार","ब्रेसवार","जुमा","बटवार"]],[["अ","च","ब","ब","ब","ज","ब"],["आथवार","चंदिरवार","बुवार","बोदवार","ब्रेसवार","जुम्मा","बटवार"],u,["आथवार","चंदिरवार","बुवार","बोदवार","ब्रेसवार","जुमा","बटवार"]],[["ज","फ़","म","अ","म","ज","ज","अ","स","ओ","न","द"],["जनवरी","फ़रवरी","मार्च","अप्रैल","मई","जून","जुलाई","अगस्त","सतुंबर","अक्तूबर","नवूमबर","दसमबर"],["जनवरी","फ़रवरी","मार्च","अप्रैल","मई","जून","जुलाई","अगस्त","सतमबर","अक्तूबर","नवमबर","दसमबर"]],[["ज","फ़","म","अ","म","ज","ज","अ","स","ओ","न","द"],["जनवरी","फ़रवरी","मार्च","अप्रैल","मई","जून","जुलाई","अगस्त","सतुंबर","अकतुम्बर","नवूमबर","दसमबर"],["जनवरी","फ़रवरी","मार्च","अप्रैल","मई","जून","जुलाई","अगस्त","सतुंबर","अकतुम्बर","नवूमबर","दसूमबर"]],[["BC","AD"],u,["ईसा ब्रोंठ","ईस्वी"]],0,[0,0],["d/M/yy","d MMM y","d MMMM y","EEEE, d MMMM y"],["a h:mm","a h:mm:ss","a h:mm:ss z","a h:mm:ss zzzz"],["{1}, {0}",u,u,u],[".",",",";","%","+","-","E","×","‰","∞","NaN",":"],["#,##0.###","#,##0%","¤ #,##0.00","#E0"],"INR","₹","इंडियन रूपी",{"JPY":["JP¥","¥"]},"ltr", plural, []];
  })(globalThis);
    